In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
pd.options.display.max_columns = None

In [2]:
descriptive = pd.read_csv('northwind_data_mart.csv', parse_dates=['tanggal_pesan','estimasi_tiba','tanggal_tiba'])
descriptive

,id_pesan,id_pelanggan,nama_pelanggan,kota,negara,id_produk,nama_produk,kategori_produk,harga,jumlah_transaksi,diskon,status_diskon,tanggal_pesan,tahun,bulan,kode_bulan,tanggal,hari,estimasi_tiba,tanggal_tiba,lama_pengiriman,status_pengiriman,id_shipper,nama_jasa_pengiriman,revenue
0,10248,VINET,Vins et alcools Chevalier,Reims,France,11,Queso Cabrales,Dairy Products,14.00,12,0.00,No Discount,1996-07-04,1996,July,7,4,Thursday,1996-08-01,1996-07-16,12,Tepat Waktu,3,Federal Shipping,168.000
1,10248,VINET,Vins et alcools Chevalier,Reims,France,42,Singaporean Hokkien Fried Mee,Grains/Cereals,9.80,10,0.00,No Discount,1996-07-04,1996,July,7,4,Thursday,1996-08-01,1996-07-16,12,Tepat Waktu,3,Federal Shipping,98.000
2,10248,VINET,Vins et alcools Chevalier,Reims,France,72,Mozzarella di Giovanni,Dairy Products,34.80,5,0.00,No Discount,1996-07-04,1996,July,7,4,Thursday,1996-08-01,1996-07-16,12,Tepat Waktu,3,Federal Shipping,174.000
3,10249,TOMSP,Toms Spezialitäten,Münster,Germany,14,Tofu,Produce,18.60,9,0.00,No Discount,1996-07-05,1996,July,7,5,Friday,1996-08-16,1996-07-10,5,Tepat Waktu,1,Speedy Express,167.400
4,10249,TOMSP,Toms Spezialitäten,Münster,Germany,51,Manjimup Dried Apples,Produce,42.40,40,0.00,No Discount,1996-07-05,1996,July,7,5,Friday,1996-08-16,1996-07-10,5,Tepat Waktu,1,Speedy Express,1696.000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2150,11077,RATTC,Rattlesnake Canyon Grocery,Albuquerque,USA,64,Wimmers gute Semmelknödel,Grains/Cereals,33.25,2,0.03,Discount,1998-05-06,1998,May,5,6,Wednesday,1998-06-03,1998-05-27,21,Terlambat,2,United Package,64.505
2151,11077,RATTC,Rattlesnake Canyon Grocery,Albuquerque,USA,66,Louisiana Hot Spiced Okra,Condiments,17.00,1,0.00,No Discount,1998-05-06,1998,May,5,6,Wednesday,1998-06-03,1998-05-27,21,Terlambat,2,United Package,17.000
2152,11077,RATTC,Rattlesnake Canyon Grocery,Albuquerque,USA,73,Röd Kaviar,Seafood,15.00,2,0.01,Discount,1998-05-06,1998,May,5,6,Wednesday,1998-06-03,1998-05-27,21,Terlambat,2,United Package,29.700
2153,11077,RATTC,Rattlesnake Canyon Grocery,Albuquerque,USA,75,Rhönbräu Klosterbier,Beverages,7.75,4,0.00,No Discount,1998-05-06,1998,May,5,6,Wednesday,1998-06-03,1998-05-27,21,Terlambat,2,United Package,31.000
2154,11077,RATTC,Rattlesnake Canyon Grocery,Albuquerque,USA,77,Original Frankfurter grüne Soße,Condiments,13.00,2,0.00,No Discount,1998-05-06,1998,May,5,6,Wednesday,1998-06-03,1998-05-27,21,Terlambat,2,United Package,26.000

In [3]:
descriptive.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 25 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id_pesan              2155 non-null   int64
 1   id_pelanggan          2155 non-null   object
 2   nama_pelanggan        2155 non-null   object
 3   kota                  2155 non-null   object
 4   negara                2155 non-null   object
 5   id_produk             2155 non-null   int64
 6   nama_produk           2155 non-null   object
 7   kategori_produk       2155 non-null   object
 8   harga                 2155 non-null   float64
 9   jumlah_transaksi      2155 non-null   int64
 10  diskon                2155 non-null   float64
 11  status_diskon         2155 non-null   object
 12  tanggal_pesan         2155 non-null   datetime64[ns]
 13  tahun                 2155 non-null   int64
 14  bulan                 2155 non-null   object
 15  kode_bulan            2155 non-null   int64
 16  tanggal               2155 non-null   int64
 17  hari                  2155 non-null   object
 18  estimasi_tiba         2155 non-null   datetime64[ns]
 19  tanggal_tiba          2155 non-null   datetime64[ns]
 20  lama_pengiriman       2155 non-null   int64
 21  status_pengiriman     2155 non-null   object
 22  id_shipper            2155 non-null   int64
 23  nama_jasa_pengiriman  2155 non-null   object
 24  revenue               2155 non-null   float64
dtypes: datetime64[ns](3), float64(3), int64(8), object(11)
memory usage: 421.0+ KB

Business Question:

1. Berapa jumlah pelanggan dari setiap negara?
2. Siapa saja pelanggan yang paling menguntungkan?
3. Siapa saja pelanggan yang harus dipertahankan menurut segmentasi?
4. Berapa rata-rata diskon berdasarkan pelanggan dan perbandingan yang non diskon?
5. Bagaimana tren penjualan berdasarkan tahun?
6. Bagaimana tren pendapatan berdasarkan tahun?
7. Produk apakah yang paling laris?
8. Kategori produk apakah yang paling menguntungkan?
9. Berapa rata-rata lama pengiriman berdasarkan jasa pengirim?

#### 1. Jumlah pelanggan dari setiap negara

In [5]:
pelanggan_unik = descriptive.groupby('negara')['id_pelanggan'].nunique()
pendapatan_total = descriptive.groupby('negara')['revenue'].sum()

merged = pd.concat([pelanggan_unik, pendapatan_total], axis=1)
merged.sort_values('id_pelanggan', ascending=False)

             id_pelanggan      revenue
negara
USA                    13  245584.6105
Germany                11  230284.6335
France                 10   81358.3225
Brazil                  9  106925.7765
UK                      7   58971.3100
Mexico                  5   23582.0775
Venezuela               4   56810.6290
Spain                   4   17983.2000
Argentina               3    8119.1000
Canada                  3   50196.2900
Italy                   3   15770.1550
Austria                 2  128003.8385
Finland                 2   18810.0525
Portugal                2   11472.3625
Denmark                 2   32661.0225
Sweden                  2   54495.1400
Switzerland             2   31692.6590
Belgium                 2   33824.8550
Ireland                 1   49979.9050
Norway                  1    5735.1500
Poland                  1    3531.9500

#### 2. Siapa saja pelanggan yang paling menguntungkan?

In [7]:
descriptive.groupby('nama_pelanggan')['revenue'].sum().reset_index().sort_values('revenue',ascending=False).head(10)

                  nama_pelanggan      revenue
59                    QUICK-Stop  110277.3050
20                  Ernst Handel  104874.9785
69            Save-a-lot Markets  104361.9500
63    Rattlesnake Canyon Grocery   51097.8005
36  Hungry Owl All-Night Grocers   49979.9050
34                 Hanari Carnes   32841.3700
38               Königlich Essen   30908.3840
23                Folk och fä HB   29567.5625
51                Mère Paillarde   28872.1900
86          White Clover Markets   27363.6050

#### 3. Segmentasi Pelanggan

In [8]:
import pandas as pd
from datetime import datetime

# Asumsi df adalah gabungan tabel Orders dan Order_Details
# Kita tentukan 'snapshot_date' (biasanya hari ini atau hari terakhir di dataset)
snapshot_date = descriptive['tanggal_pesan'].max() + pd.Timedelta(days=1)

# Agregasi data per pelanggan
rfm = descriptive.groupby('id_pelanggan').agg({
    'tanggal_pesan': lambda x: (snapshot_date - x.max()).days, # Recency
    'id_pesan': 'nunique',                                     # Frequency
    'revenue': 'sum'                                           # Monetary
})

# Rename kolom
rfm.rename(columns={
    'tanggal_pesan': 'Recency',
    'id_pesan': 'Frequency',
    'revenue': 'Monetary'
}, inplace=True)

In [9]:
# Skor 5 adalah yang terbaik (Recency rendah = skor tinggi, F & M tinggi = skor tinggi)
rfm['R_score'] = pd.qcut(rfm['Recency'], 5, labels=[5, 4, 3, 2, 1])
rfm['F_score'] = pd.qcut(rfm['Frequency'].rank(method='first'), 5, labels=[1, 2, 3, 4, 5])
rfm['M_score'] = pd.qcut(rfm['Monetary'], 5, labels=[1, 2, 3, 4, 5])

# Gabungkan jadi satu skor RFM
rfm['RFM_Group'] = rfm.R_score.astype(str) + rfm.F_score.astype(str) + rfm.M_score.astype(str)
rfm

              Recency  Frequency    Monetary R_score F_score M_score RFM_Group
id_pelanggan
ALFKI              28          6   4273.0000       3       2       2       322
ANATR              64          4   1402.9500       2       1       1       211
ANTON              99          7   7023.9775       1       2       3       123
AROUT              27         13  13390.6500       3       4       4       344
BERGS              64         18  24927.5775       2       5       5       255
...               ...        ...         ...     ...     ...     ...       ...
WARTH              22         15  15648.7025       3       5       4       354
WELLI              59          9   6068.2000       2       3       3       233
WHITC               6         14  27363.6050       5       5       5       555
WILMK              30          7   3161.3500       3       3       2       332
WOLZA              14          7   3531.9500       4       3       2       432

[89 rows x 7 columns]

In [10]:
# Mapping menggunakan regex
segs = {
    r'[1-5][1-2]5':'Big Spenders',
    r'555': 'Best Customers',
    r'[4-5][4-5][1-2]':'Cheap Loyalist',
    r'51[4-5]':'New Big Spenders',
    r'[1-2][3-5][4-5]':'High Value at Risk',
    r'333':'Average Joe',
    r'11[1-2]':'One Time Low Spender',
    r'[4-5]13':'Promising'
}

# gabungkan skor
rfm['Segment'] = rfm['R_score'].astype(str) + rfm['F_score'].astype(str) + rfm['M_score'].astype(str)
rfm['Segment'] = rfm['Segment'].replace(segs, regex=True)

In [11]:
rfm.loc[rfm['Segment'] == 'High Value at Risk']

,Recency,Frequency,Monetary,R_score,F_score,M_score,RFM_Group,Segment
id_pelanggan,,,,,,,,
BERGS,64,18,24927.5775,2,5,5,255,High Value at Risk
BLONP,115,11,18534.0800,1,4,4,144,High Value at Risk
MEREP,189,13,28872.1900,1,4,5,145,High Value at Risk
SEVES,92,9,16215.3250,1,3,4,134,High Value at Risk
VAFFE,35,11,15843.9250,2,4,4,244,High Value at Risk

Pelanggan-pelanggan tersebut dulu sangat loyal dan belanja banyak, tapi sekarang sudah lama tidak muncul. Ini prioritas nomor 1 untuk diselamatkan.

In [12]:
rfm.loc[rfm['Segment'] == 'Best Customers']

,Recency,Frequency,Monetary,R_score,F_score,M_score,RFM_Group,Segment
id_pelanggan,,,,,,,,
BONAP,1,17,21963.2525,5,5,5,555,Best Customers
ERNSH,2,30,104874.9785,5,5,5,555,Best Customers
HUNGO,7,19,49979.9050,5,5,5,555,Best Customers
RATTC,1,18,51097.8005,5,5,5,555,Best Customers
SAVEA,6,31,104361.9500,5,5,5,555,Best Customers
WHITC,6,14,27363.6050,5,5,5,555,Best Customers

Pelanggan-pelanggan tersebut sering belanja, baru saja kembali, dan sekali transaksi dalam jumlah besar. Jaga loyalitas pelanggan-pelanggan ini

In [13]:
rfm.loc[rfm['Segment'] == 'Average Joe']

,Recency,Frequency,Monetary,R_score,F_score,M_score,RFM_Group,Segment
id_pelanggan,,,,,,,,
BSBEV,23,10,6089.900,3,3,3,333,Average Joe
MAISD,30,7,9736.075,3,3,3,333,Average Joe

Pelanggan ini belanjanya biasa saja, frekuensi sedanng. Disarankan untuk memberikan penawaran untuk meningkatkan mereka jadi *loyal customers*

In [14]:
rfm.loc[rfm['Segment'] == 'One Time Low Spender']

,Recency,Frequency,Monetary,R_score,F_score,M_score,RFM_Group,Segment
id_pelanggan,,,,,,,,
CENTC,658,1,100.8000,1,1,1,111,One Time Low Spender
CONSH,104,3,1719.1000,1,1,1,111,One Time Low Spender
DUMON,80,4,1615.9000,1,1,1,111,One Time Low Spender
GROSR,140,2,1488.7000,1,1,1,111,One Time Low Spender
LAUGB,126,3,522.5000,1,1,1,111,One Time Low Spender
LAZYK,350,2,357.0000,1,1,1,111,One Time Low Spender
LETSS,84,4,3076.4725,1,1,2,112,One Time Low Spender
TRAIH,119,3,1571.2000,1,1,1,111,One Time Low Spender

Pelanggan-pelanggan ini belanjanya sekali, dalam jumlah kecil, dan sudah lama sekali. Disarankan biaya marketing untuk mereka lebihi baik dialokasikan ke hal lain

#### 4. Rata-rata diskon berdasarkan pelanggan

In [15]:
print(f"Persentase diskon : {round(len(descriptive[descriptive['diskon'] == 0]) / len(descriptive), 2)}")
print(f"Persentase non-diskon : {round(len(descriptive[descriptive['diskon'] > 0]) / len(descriptive), 2)}")

Persentase diskon : 0.61
Persentase non-diskon : 0.39

In [16]:
diskon = descriptive.groupby('nama_pelanggan')['diskon'].mean().sort_values(ascending=False)
pendapatan_total = descriptive.groupby('nama_pelanggan')['revenue'].sum().sort_values(ascending=False)

merged = pd.concat([diskon, pendapatan_total], axis=1)
merged.sort_values('diskon', ascending=False)

                                diskon     revenue
nama_pelanggan
Simons bistro                 0.140000  16817.0975
La maison d'Asie              0.125806   9328.2000
Bólido Comidas preparadas     0.116667   4232.8500
Hungry Owl All-Night Grocers  0.113636  49979.9050
Let's Stop N Shop             0.110000   3076.4725
...                                ...         ...
Rancho grande                 0.000000   2844.1000
Franchi S.p.A.                0.000000   1545.7000
B's Beverages                 0.000000   6089.9000
Cactus Comidas para llevar    0.000000   1814.8000
Wolski  Zajazd                0.000000   3531.9500

[89 rows x 2 columns]

#### 5. Tren Penjualan Berdasarkan Tahun dan Bulan

In [17]:
descriptive.groupby('tahun')['id_pesan'].count().reset_index()

   tahun  id_pesan
0   1996       405
1   1997      1059
2   1998       691

In [18]:
descriptive.groupby(['tahun','bulan','kode_bulan'])['id_pesan'].count().reset_index().sort_values(['tahun','kode_bulan'])

    tahun      bulan  kode_bulan  id_pesan
2    1996       July           7        59
0    1996     August           8        69
5    1996  September           9        57
4    1996    October          10        73
3    1996   November          11        66
1    1996   December          12        81
10   1997    January           1        85
9    1997   February           2        79
13   1997      March           3        77
6    1997      April           4        81
14   1997        May           5        96
12   1997       June           6        76
11   1997       July           7        77
7    1997     August           8        84
17   1997  September           9        95
16   1997    October          10       106
15   1997   November          11        89
8    1997   December          12       114
20   1998    January           1       152
19   1998   February           2       122
21   1998      March           3       178
18   1998      April           4       180
22   1998        May           5        59

#### 6. Tren Pendapatan Berdasarkan Tahun dan Bulan

In [19]:
# tren pendapatan

descriptive.groupby('tahun')['revenue'].sum().reset_index()

   tahun      revenue
0   1996  208083.9700
1   1997  617085.2035
2   1998  440623.8660

In [21]:
descriptive.groupby(['tahun','bulan','kode_bulan'])['revenue'].sum().reset_index().sort_values(['tahun','kode_bulan'])

    tahun      bulan  kode_bulan      revenue
2    1996       July           7   27861.8950
0    1996     August           8   25485.2750
5    1996  September           9   26381.4000
4    1996    October          10   37515.7250
3    1996   November          11   45600.0450
1    1996   December          12   45239.6300
10   1997    January           1   61258.0700
9    1997   February           2   38483.6350
13   1997      March           3   38547.2200
6    1997      April           4   53032.9525
14   1997        May           5   53781.2900
12   1997       June           6   36362.8025
11   1997       July           7   51020.8575
7    1997     August           8   47287.6700
17   1997  September           9   55629.2425
16   1997    October          10   66749.2260
15   1997   November          11   43533.8090
8    1997   December          12   71398.4285
20   1998    January           1   94222.1105
19   1998   February           2   99415.2875
21   1998      March           3  104854.1550
18   1998      April           4  123798.6825
22   1998        May           5   18333.6305

#### 7. Produk apa yang paling laris?

In [22]:
df_hist = descriptive.groupby(['nama_produk','harga'])['jumlah_transaksi'].mean().reset_index().sort_values('jumlah_transaksi',ascending=False)
df_hist

                       nama_produk  harga  jumlah_transaksi
84      Northwoods Cranberry Sauce   32.0         70.000000
118             Schoggi Schokolade   43.9         45.833333
128                 Sirop d'érable   22.8         43.666667
20                       Chocolade   10.2         42.500000
96                    Pâté chinois   19.2         40.909091
..                             ...    ...               ...
98                  Queso Cabrales   14.0         12.000000
60                           Konbu    4.8         11.625000
121  Singaporean Hokkien Fried Mee    9.8         10.000000
50             Gustaf's Knäckebröd   16.8          9.000000
64       Laughing Lumberjack Lager   11.2          5.000000

[156 rows x 3 columns]

#### 8. Kategori produk yang paling menguntungkan

In [23]:
descriptive.groupby('kategori_produk')['revenue'].sum().sort_values(ascending=False)

kategori_produk
Beverages         267868.1800
Dairy Products    234507.2850
Confections       167357.2250
Meat/Poultry      163022.3595
Seafood           131261.7375
Condiments        106047.0850
Produce            99984.5800
Grains/Cereals     95744.5875
Name: revenue, dtype: float64

In [24]:
descriptive.groupby(['negara','kategori_produk'])['id_pesan'].count().reset_index().sort_values('negara')

        negara kategori_produk  id_pesan
0    Argentina       Beverages         7
1    Argentina      Condiments         3
2    Argentina     Confections         8
3    Argentina  Dairy Products         6
4    Argentina  Grains/Cereals         1
..         ...             ...       ...
159  Venezuela     Confections        19
160  Venezuela  Dairy Products        23
161  Venezuela  Grains/Cereals         9
162  Venezuela    Meat/Poultry         6
164  Venezuela         Seafood        23

[165 rows x 3 columns]

#### 9. Rata-rata lama pengiriman berdasarkan jasa pengirim

In [25]:
descriptive.groupby('nama_jasa_pengiriman')['lama_pengiriman'].mean()

nama_jasa_pengiriman
Federal Shipping    7.449612
Speedy Express      8.280186
United Package      9.716435
Name: lama_pengiriman, dtype: float64